# YOLO_fish：YOLOv8n + RepC3k2@P4/P5 + FishDetect + DualGateConcat（neck 三处 fusion）
# 在 neck 的所有三个内部 fusion 点将原 Concat 替换为 DualGateConcat：
#   - layer 11: P5↑ ⊕ P4 lat
#   - layer 14: P4↑ ⊕ P3 lat
#   - layer 17: P3↓ ⊕ P4 mid
#   - layer 20: P4↓ ⊕ P5 lat
# 说明：为避免训练早期 gate 方向抖动，给每个 DualGateConcat
# 使用 gamma_init=0.1（小非零初值），让其从 epoch 0 就开始产生有效梯度。

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1  P2/4
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3  P3/8
  - [-1, 6, C2f, [256, True]]        # 4  <- P3 lateral
  - [-1, 1, Conv, [512, 3, 2]]       # 5  P4/16
  - [-1, 2, RepC3k2, [512, True]]    # 6  <- P4 lateral
  - [-1, 1, Conv, [1024, 3, 2]]      # 7  P5/32
  - [-1, 2, RepC3k2, [1024, True]]   # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10  P5 -> P4
  - [[-1, 6], 1, DualGateConcat, [0.1]]          # 11  ★ P5↑ ⊕ P4 lat
  - [-1, 3, C2f, [512]]                          # 12  P4 merged

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13  P4 -> P3
  - [[-1, 4], 1, DualGateConcat, [0.1]]          # 14  ★ P4↑ ⊕ P3 lat
  - [-1, 3, C2f, [256]]                          # 15  P3 out

  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, DualGateConcat, [0.1]]         # 17  ★ P3↓ ⊕ P4 mid
  - [-1, 3, C2f, [512]]                          # 18  P4 out

  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, DualGateConcat, [0.1]]          # 20  ★ P4↓ ⊕ P5 lat
  - [-1, 3, C2f, [1024]]                         # 21  P5 out

  - [[15, 18, 21], 1, FishDetect, [nc]]          # 22
